In [1]:
#필요한 import
import pandas as pd
import numpy as np

In [2]:
list1 = ['홍', '김', '이', '박', '최']
list2 = ['길동', '철수', '성계', '지성', '용수']
list3 = [23, 45, 99, 41, 48]
names_dic = {'family_name':list1, 'first_name':list2, 'age':list3}
names = pd.DataFrame(names_dic)
names

  family_name first_name  age
0           홍         길동   23
1           김         철수   45
2           이         성계   99
3           박         지성   41
4           최         용수   48

In [3]:
list(zip(list1, list2, list3))

[('홍', '길동', 23),
 ('김', '철수', 45),
 ('이', '성계', 99),
 ('박', '지성', 41),
 ('최', '용수', 48)]

In [4]:
pd.DataFrame(list(zip(list1, list2, list3)),
 columns=['familyName', 'firstName', 'age'])

  familyName firstName  age
0          홍        길동   23
1          김        철수   45
2          이        성계   99
3          박        지성   41
4          최        용수   48

In [5]:
#list는 길이가 같아야 한다.!

In [6]:
#indaex 생성 
names_dic = {'family_name':list1, 'first_name':list2, 'age':list3}
names = pd.DataFrame(names_dic,
 index=['1번학생', '2번학생', '3번학생', '4번학생', '5번학생'])
names

     family_name first_name  age
1번학생           홍         길동   23
2번학생           김         철수   45
3번학생           이         성계   99
4번학생           박         지성   41
5번학생           최         용수   48

In [7]:
names = pd.DataFrame(names_dic)
names.to_csv('names.csv')
new_names = pd.read_csv('names.csv')
# 아래와 같은 이상한 값을 처리하기 위해서
# 1. names.to_csv('names.csv', index=False)
# 2. pd.read_csv('names.csv', index_col=0)

In [8]:
new_names

   Unnamed: 0 family_name first_name  age
0           0           홍         길동   23
1           1           김         철수   45
2           2           이         성계   99
3           3           박         지성   41
4           4           최         용수   48

In [9]:
diamonds = pd.read_csv('data/diamonds.csv', nrows=1000)
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float64
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float64
 5   table    1000 non-null   float64
 6   price    1000 non-null   int64
 7   x        1000 non-null   float64
 8   y        1000 non-null   float64
 9   z        1000 non-null   float64
dtypes: float64(6), int64(1), object(3)
memory usage: 78.2+ KB

In [10]:
#np.finfo or np.iinfo() 사용

In [11]:
diamonds2 = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'table': np.float16,
 'x': np.float16,
 'y': np.float16,
 'z': np.float16,
 'price': np.int16
 })
diamonds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float16
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float16
 5   table    1000 non-null   float16
 6   price    1000 non-null   int16
 7   x        1000 non-null   float16
 8   y        1000 non-null   float16
 9   z        1000 non-null   float16
dtypes: float16(6), int16(1), object(3)
memory usage: 37.2+ KB

In [12]:
diamonds3 = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'table': np.float16,
 'x': np.float16,
 'y': np.float16,
 'z': np.float16,
 'price': np.int16,
 'color': 'category',
 'cut': 'category',
 'clarity': 'category'
 })
diamonds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float16
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float16
 5   table    1000 non-null   float16
 6   price    1000 non-null   int16
 7   x        1000 non-null   float16
 8   y        1000 non-null   float16
 9   z        1000 non-null   float16
dtypes: category(3), float16(6), int16(1)
memory usage: 17.7 KB

In [13]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds4 = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'price': np.int16,
 'table': np.float16,
 'color': 'category',
 'cut': 'category',
 'clarity': 'category'
 },
 usecols=cols)
diamonds4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float16
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float16
 5   table    1000 non-null   float16
 6   price    1000 non-null   int16
dtypes: category(3), float16(3), int16(1)
memory usage: 11.8 KB

In [14]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds_iter = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'price': np.int16,
 'color': 'category',
 'cut': 'category',
 'clarity': 'category'
 },
 usecols=cols,
 chunksize=200 #이 부분이죠!
 )
def process(df):
 return f'processed {df.shape} shape of df'
for chunk in diamonds_iter:
 print(process(chunk))

processed (200, 7) shape of df
processed (200, 7) shape of df
processed (200, 7) shape of df
processed (200, 7) shape of df
processed (200, 7) shape of df

In [ ]:
#.xlsx > openpyxl 라이브러리 필요 
#db 작업 -> import sqlite3 [db파일과 연결] and import sqlalchemy as sa [db파일에서 read_sql 실행]
#.json(JavaScript Object Notation) > import json > json.dumps(names_dic, ensure_ascii=False)
#.json -> names.to_json(orient='records', force_ascii=False)
# pd.read_json(json_index, orient='')

columns
records
split
index
values
table

In [15]:
#values 는 각 행을 list 로 표현합니다. 열/인덱스 값은 포함하지 않는다는 것을 기억하세요!
json_values = names.to_json(orient='values', force_ascii=False)
json_values
# pd.read_json(json_values).rename(columns={0:'성', 1:'이름', 2:'나이'})

'[["홍","길동",23],["김","철수",45],["이","성계",99],["박","지성",41],["최","용수",48]]'

In [17]:
json_table = names.to_json(orient='table', force_ascii=False)
json_table
pd.read_json(json_table, orient='table')

  family_name first_name  age
0           홍         길동   23
1           김         철수   45
2           이         성계   99
3           박         지성   41
4           최         용수   48